Repository: jiya-talreja/multi_language_detection
Catalog: backend/input/opus/en-hi.tmx
Source language: en
Languages: hi

source: There's something we need to talk about.
hi: मुझे तुमसे किसी बारे में बात करनी है।

source: Tom must have seen something.
hi: टॉम को कुछ दिखा होगा।

source: Tom is writing something.
hi: टॉम कुछ लिख रहा है।

source: It's no use crying over spilt milk.
hi: अब पछताए क्या होत जब चिड़िया चुग गई खेत।

source: Can I show you something?
hi: क्या मैं तुम्हें कुछ दिखा सकता हूं?

source: Something's happened to Tom.
hi: टॉम को कुछ हो गया है।

source: Why don't they do something?
hi: वे कुछ करते क्यों नहीं?

source: Tom is trying to say something.
hi: टॉम कुछ कहने की कोशिश कर रहा है।

source: I'm going to tell you something.
hi: मैं तुम्हें कुछ बताने वाला हूँ।

source: Who wants freedom?
hi: आज़ादी किसे चाहिए?

source: Tom changed the future.
hi: टॉम ने भविष्य बदला।

source: Don't ask him any questions about his marriage.
hi: उसकी शादी के बारे में उससे कोई सवाल मत पूछना।

source: I like living in this country.
hi: मुझे इस देश में रहना अच्छा लगता है।

source: Were you looking for these glasses?
hi: क्या तुम इस चश्मे को ढूँढ रहे थे?

source: Are these the glasses you were looking for?
hi: क्या यह वह ऐनक है जिसे आप ढूँढ रहे थे ?

source: When do you usually go to bed?
hi: तुम आमतौर पर कितने बजे सोते हो ?

source: Do you know him well?
hi: तुम उसे अच्छी तरह से जानते हो क्या?

source: My watch isn't working properly.
hi: मेरी घड़ी ख़राब हो गई।

source: Who buys such art?
hi: इस तरह की कलाकृति को कौन ख़रीदता है?

source: He is helping this lady enter her car.
hi: वह इस महिला की गाड़ी में बैठने में मदद कर रहा है।

source: Stop crying. You have to go.
hi: रोना-धोना बन्द करो। तुम्हें जाना ही पड़ेगा।

source: The party was successful.
hi: पार्टी कामयाब रही।

source: We often hide our thoughts in front of others.
hi: हम अकसर दूसरों के सामने अपने ख़यालों को छुपाते हैं।

source: How do you know Mary?
hi: तुम मेरी को कैसे जानते हो ?

source: That is a secret.
hi: यह एक राज़ है ।

source: Mr. Smith has arrived.
hi: स्मिथ जी आ गए हैं ।

source: Finish this as soon as possible.
hi: इसे जितनी जल्दी हो सके ख़त्म करो ।

source: She had lost all hope after the death of her husband.
hi: पति के चल बसने के बाद वह पूरी तरह उम्मीद छोड़ बैठी।

source: I do not work on Sunday.
hi: मैं रविवार को काम नहीं करता।

source: I don't go to work on Sundays.
hi: मैं रविवार को काम पर नहीं जाता।

source: He got 90 marks in his English test.
hi: उसे अंग्रेज़ी में नब्बे अंक मिले।

source: He got 90 in English.
hi: उसके अंग्रेज़ी में नब्बे मार्क्स आएँ हैं।

source: He isn't afraid of anything.
hi: उसे किसी भी चीज़ से डर नहीं है।

source: You need to be attentive during the interview and grab any opportunity that presents itself.
hi: इंटरव्यू के दौरान तुम्हें सतर्क रहना होगा और मौक़ा दिखते ही उसे हाथ ले लेना होगा।

source: You can't swim. Isn't that so?
hi: तुम्हें तैरना नहीं आता। है ना?

source: Our complete plan got spoiled.
hi: पूरा प्लान चौपट हो गया।

source: Our plan flopped.
hi: पूरा प्लान चौपट हो गया।

source: You are ruined.
hi: सत्यानाश कर डाला तू ने ।

source: Even Hakim Luqman has no medicine for superstition.
hi: वहम की दवा तो हकीम लुक़मान के पास भी नहीं है।

source: Mars has two moons.
hi: मंगल के दो चांद हैं।

source: Greece cancels the referendum.
hi: यूनान जनमत-संग्रह को रद्द कर देता है।

source: It makes no difference.
hi: कोई फरक नहीं पड़ता।

source: Who?
hi: कौन?

source: I did not understand.
hi: मुझे समझ नहीं आया।

source: Russia should give the Kuril Islands back to Japan.
hi: रूस ने कुरील द्वीप जापान को लौटाने चाहिए।

source: No one's in sight.
hi: आसपास कोई नहीं है।

source: Anyone could do that.
hi: वह तो कोई भी कर सकता है।

source: Where is my son?
hi: मेरा बेटा कहाँ है?

source: My name is Soundararajan.
hi: मेरा नाम सौंदरराजन है।

source: I gave him a grammar book.
hi: मैनें उनको एक व्याकरण की पुस्तक दी।

source: Is everyone all right?
hi: सब ठीक हैं?

source: Anybody can do this.
hi: यह तो कोई भी कर सकता है।

source: How many soldiers did you see?
hi: कितने सैनिक दिखाई दिए?

source: How many people have you slept with?
hi: तुम कितने लोगों के साथ सोये हो?

source: What's the time on your side?
hi: तुम्हारे यहाँ कितने बजे हैं?

source: Tom's alive.
hi: टॉम ज़िंदा है।

source: Tom's homeless.
hi: टॉम बेघर है।

source: Tom's swimming.
hi: टॉम तैर रहा है।

source: Tom's violent.
hi: टॉम हिंसक है।

source: Tom helped.
hi: टॉम ने मदद की।

source: Tom clapped.
hi: टॉम ने ताली बजाई।

source: They're wrong.
hi: वे गलत हैं।

source: They're quiet.
hi: वे शांत हैं।

source: They're green.
hi: हरे हैं।

source: They're fighting.
hi: वे लड़ रहे हैं।

source: They're bad.
hi: वे बुरे हैं।

source: They stood.
hi: वे खड़े हुए।

source: They laughed.
hi: वे हसें।

source: They called.
hi: उन्होंने बुलाया।

source: That's beautiful.
hi: वह सुंदर है।

source: Stay close.
hi: पास रहना।

source: Someone's talking.
hi: कोई बात कर रहा है।

source: Someone's calling.
hi: कोई बुला रहा है।

source: Somebody answered.
hi: किसी ने जवाब दिया।

source: Say goodbye.
hi: अलविदा कहो।

source: Nothing's there.
hi: वहाँ कुछ नहीं है।

source: Nothing'll happen.
hi: कुछ नहीं होगा।

source: Nobody's there.
hi: वहाँ कोई नहीं है।

source: Nobody's around.
hi: आसपास कोई नहीं है।

source: Nobody'll know.
hi: किसी को पता नहीं चलेगा।

source: Leave everything.
hi: सब कुछ छोड़ दो।

source: Keep walking.
hi: चलते रहो।

source: Keep this.
hi: यह रखो।

source: I've forgotten.
hi: मैं भूल गया हूँ।

source: I'm quitting.
hi: मैं छोड़ रहा हूँ।

source: I'm positive.
hi: मैं सकारात्मक हूँ।

source: I'm naked.
hi: मैं नंगा हूँ।

source: I'll sing.
hi: मैं गाऊँगा।

source: Everyone's quiet.
hi: सभी शांत है।

source: Everybody claps.
hi: सभी तालीयाँ बजाते हैं।

source: Don't fight.
hi: लड़ना मत।

source: Come forward.
hi: आगे आओ।

source: Italy isn't Greece.
hi: इटली यूनान नहीं है।

source: Sweden's population is growing.
hi: स्वीडन की आबादी बढ़ रही है।

source: Greece has many islands.
hi: यूनान में कई द्वीप हैं।

source: He did not read the book.
hi: उसने वह किताब पड़ी नहीं।

source: You've grown.
hi: तुम बड़े हुए हो।

source: It's time.
hi: वक़्त हो गया है।

source: It's scary.
hi: डरावना है।

source: It's possible.
hi: मुमकिन है।

source: This is Italy.
hi: यह इटली है।

source: My sister started crying.
hi: मेरी बहन रोने लगी।

source: These books are yours.
hi: ये किताबें आपकी हैं।

source: Even children know that.
hi: वह तो बच्चों को भी पता होता है।

source: That flag is very beautiful.
hi: वह झंडा बहुत सुंदर है।

source: Wait a little longer.
hi: थोड़ी देर और रुको।

source: Come near the fire.
hi: आग के पास आओ।

source: The age of nuclear power is not yet over.
hi: नाभिकीय ऊर्जा का काल अभी तक खतम नहीं हुआ है।

source: Don't say anything!
hi: कुछ मत कहना!

source: Are there waterfalls in your country?
hi: क्या तुम्हारे देश में झरने हैं?

source: If you have a time, could you translate some sentences below, please?
hi: अगर आपके पास थोड़ा समय हो, तो कृपया निम्न वाक्यों का अनुवाद करेंगे?

source: A country is a dangerous machine.
hi: देश एक खतरनाक मशीन होती है।

source: I know Portuguese, English, and Russian.
hi: मुझे पुर्तुगाली, अंग्रेज़ी और रूसी आती हैं।

source: The color of it is red.
hi: इसका रंग लाल है|

source: Damacus is located in Syria.
hi: दमिश्क सीरिया में स्थित है।

source: Electric power companies are seeking to reduce their use of coal.
hi: बिजली कम्पनियाँ कोयले का इस्तेमाल कम करने की कोशिश कर रही हैं।

source: That man is a soldier.
hi: वह आदमी सैनिक है।

source: The cost of the book is five dollars.
hi: किताब की कीमत पाँच डॉलर है।

source: The distance from my house to your house is two kilometers.
hi: मेरे घर से तुम्हारे घर के बीच का अंतर दो किलोमीटर है।

source: We have only two dollars.
hi: हमारे पास तो बस दो डॉलर हैं।

source: We should study.
hi: हमें पढ़ाई करनी चाहिए।

source: They were both naked.
hi: वे दोनों नंगे थे।

source: Both were naked.
hi: दोनों नंगे थे।

source: What does he want in return?
hi: उसे बदले में क्या चाहिए?

source: Actinium was discovered by André-Louis Debierne in 1899.
hi: ऐक्टिनियम का खोज आंड्रे-लूई डेबिएर्न ने साल १८९९ में किया था।

source: Here's Japan's flag.
hi: यह रहा जापान का झंडा।

source: It's very difficult to know oneself.
hi: अपने आप को जानना बहुत मुश्किल होता है।

source: Are you gay?
hi: तुम गे हो?

source: It's Wednesday.
hi: बुधवार है।

source: There are only two kind of people in the world.
hi: दुनिया में बस दो तरह के लोग होते हैं।

source: Do you have it?
hi: तुम्हारे पास है?

source: Love the earth.
hi: पृथ्वी से प्यार करो।

source: Take care of our planet.
hi: हमारे ग्रह का ध्यान रखो।

source: You are a liar.
hi: तुम झूठे हो।

source: My eyes are red.
hi: मेरी आँखें लाल हैं।

source: He grabbed my breasts.
hi: उसने मेरे स्तन पकड़ लिये।

source: How many people have you had sex with in the last year?
hi: गये साल में तुम ने कितने लोगों के साथ सेक्स किया है?

source: They met in Spain seven years ago.
hi: वे सात साल पहले स्पेन में मिलें।

source: We're afraid.
hi: हम डरे हुए हैं।

source: You're aggressive.
hi: तुम आक्रामक हो।

source: You're artistic.
hi: तुम कलात्मक हो।

source: We're ashamed.
hi: हम शरमिंदा हैं।

source: Mary is attractive.
hi: मैरी आकर्षक है।

source: You're attractive.
hi: तुम आकर्षक हो।

source: I'm clean.
hi: मैं साफ़ हूँ।

source: You're dangerous.
hi: तुम खतरनाक हो।

source: I'm lazy.
hi: मैं आलसी हूँ।

source: You're OK.
hi: तुम ठीक हो।

source: Tom is useless.
hi: टॉम बेकार है।

source: We're dancing.
hi: हम नाच रहे हैं।

source: Tom ran.
hi: टॉम भागा।

source: We'll sing.
hi: हम गाएंगे।

source: Who's staying?
hi: कौन रह रहा है?

source: I am Death.
hi: मैं मृत्यु हूँ।

source: I'm not going alone.
hi: मैं अकेला नहीं जा रहा।

source: Tom didn't die alone.
hi: टॉम अकेला नहीं मरा।

source: I've gotten used to living alone.
hi: मुझे अकेले रहने की आदत पड़ गयी है।

source: Tom was sitting alone at the bar.
hi: टॉम बार में अकेला बैठा था।

source: They're in math class.
hi: वे गणित के क्लास में है।

source: Why don't you ever help?
hi: तुम कभी भी मदद क्यों नहीं करते?

source: I'm proud to be a Burgundian.
hi: मुझे बुरगुंदीयाई होने पर गर्व है।

source: Hinduism is the main religion in India.
hi: हिंदू धर्म भारत का मुख्य धर्म है।

source: Tom will forgive Mary.
hi: टॉम मेरी को माफ़ कर देगा।

source: He lives like a king.
hi: वह किसी राजा की तरह जीता है।

source: You stole my heart.
hi: तुमने मेरा दिल चुराया।

source: You're not smiling.
hi: तुम हंस नहीं रहे हो

source: You're so hot.
hi: तुम कितने हॉट हो।

source: You're wasting water.
hi: तुम पानी बरबाद कर रहे हो।

source: Why don't you cut your hair?
hi: तुम अपने बाल क्यों नहीं काटते?

source: I hope he won't be disappointed.
hi: मुझे आशा है कि वह निराश नहीं होगा।

source: Mary is very beautiful.
hi: मैरी बहुत सुंदर है।

source: That is you.
hi: वह तुम हो।

source: Europe is not a country.
hi: युरोप देश नहीं है।

source: I have searched internet to learn Portuguese.
hi: मैने पोर्तुगीज का ज्ञान लेने के लिये इंटरनेट का उपयोग किया है।

source: I am learning for you.
hi: मैं आपके लिये ज्ञान/विद्या अर्जित कर रहा हूँ।

source: This is gold.
hi: यह सोना है।

source: This is huge.
hi: यह विशाल है।

source: What's the rule?
hi: नियम क्या है?

source: Don't laugh!
hi: हस मत!

source: I was only joking.
hi: मैं तो बस मजाक कर रहा था।

source: I was just joking.
hi: मैं तो बस मजाक कर रहा था।

source: What school did you go to?
hi: तुम कौनसे स्कूल गये थे?

source: I am Egyptian.
hi: मैं मिस्री हूँ।

source: I'm Tom's driver.
hi: मैं टॉम का ड्राईवर हूँ.

source: It isn't Tom.
hi: टॉम नहीं है।

source: It wasn't Tom.
hi: टॉम नहीं था।

source: It's not Tom.
hi: टॉम नहीं है।

source: It's Tom's office.
hi: टॉम का दफतर है।

source: That wasn't Tom.
hi: वह टॉम नहीं था।

source: They want Tom.
hi: उन्हें टॉम चाहिए।

source: They've seen Tom.
hi: उन्होंने टॉम को देखा है।

source: Tom came close.
hi: टॉम पास आया।

source: Tom congratulated Mary.
hi: टॉम ने मैरी को बधाई दी।

source: Tom didn't come.
hi: टॉम आया नहीं।

source: Tom doesn't understand.
hi: टॉम नहीं समझता।

source: Tom eats anything.
hi: टॉम कुछ भी खाता है।

source: Tom finally arrived.
hi: टॉम आख़िरकार आ ही गया ।

source: Tom is learning.
hi: टॉम सीख रहा है।

source: Tom is naked.
hi: टॉम नंगा है।

source: Tom isn't naked.
hi: टॉम नंगा नहीं है।

source: Tom isn't OK.
hi: टॉम ठीक नहीं है।

source: Tom isn't there.
hi: टॉम नहीं है।

source: Tom looked again.
hi: टॉम ने फिर देखा।

source: Tom needed this.
hi: टॉम के इसकी ज़रूरत थी।

source: Tom needed water.
hi: टॉम को पानी की ज़रूरत थी।

source: Tom needs water.
hi: टॉम को पानी की ज़रूरत है।

source: Tom rescued Mary.
hi: टौम ने मैरी को बचाया ।

source: He's my husband.
hi: यह मेरा पति है।

source: Tom threatened me.
hi: टॉम ने मुझे धमकी दी।

source: Tom told her.
hi: टॉम ने उसे बताया।

source: Tom turned red.
hi: टॉम लाल हो गया।

source: Tom was alone.
hi: टॉम अकेला था।

source: Tom was crazy.
hi: टॉम पागल था।

source: Tom was naked.
hi: टॉम नंगा था।

source: Tom was rich.
hi: टॉम अमीर था।

source: Tom was running.
hi: टॉम भाग रहा था।

source: Tom was sad.
hi: टॉम उदास था।

source: Tom was sick.
hi: टॉम बीमार था।

source: Tom was silent.
hi: टॉम शांत था।

source: Tom was smiling.
hi: टॉम मुस्कुरा रहा था।

source: Tom was surrounded.
hi: टॉम को घेर लिया गया था।

source: Tom was there.
hi: टॉम वहाँ था।

source: Tom was unconscious.
hi: टॉम बेहोश था।

source: Tom was walking.
hi: टॉम चल रहा था।

source: Tom was working.
hi: टॉम काम कर रहा था।

source: Tom wasn't bald.
hi: टॉम गंजा नहीं था।

source: Tom wasn't crazy.
hi: टॉम पागल नहीं था।

source: Tom wasn't here.
hi: टॉम यहाँ नहीं था।

source: Tom wasn't home.
hi: टॉम घर पर नहीं था।

source: Tom's phone rang.
hi: टॉम का फ़ोन बजा।

source: We help Tom.
hi: हम टॉम की मदद करते हैं।

source: We're all crazy.
hi: हम सब पागल हैं।

source: We're in town.
hi: हम शहर में हैं।

source: We're wasting water.
hi: हम पानी बरबाद कर रहे हैं।

source: We're with you.
hi: हम तुम्हारे साथ हैं।

source: We're coming in.
hi: हम अंदर आ रहे हैं।

source: We eat together.
hi: हम एक-साथ खाते हैं।

source: We need water.
hi: हमें पानी की ज़रूरत है।

source: We saw nothing.
hi: हमें कुछ नहीं दिखा।

source: We were eating.
hi: हम खा रहे थे।

source: We were wrong.
hi: हम गलत थे।

source: We weren't friends.
hi: हम दोस्त नहीं थे।

source: We'll stop you.
hi: हम तुम्हें रोकेंगे।

source: They caught me.
hi: उन्होंने मुझे पकड़ा।

source: They didn't run.
hi: वे नहीं भागे।

source: They don't understand.
hi: वे समझते नहीं।

source: They found this.
hi: उन्हें यह मिला।

source: They kept running.
hi: वे भागते रहे।

source: They saw Tom.
hi: उन्होंने टॉम को देखा।

source: They walked together.
hi: वे एक-साथ चले।

source: They were soldiers.
hi: वे सैनिक थे।

source: They'll hear us.
hi: वे हमें सुन लेंगे।

source: They're both laughing.
hi: वे दोनों हस रहें हैं।

source: They're not moving.
hi: वे हिल नहीं रहे।

source: They're not soldiers.
hi: वे सैनिक नहीं हैं।

source: They're watching me.
hi: उनकी मुझ पर नज़र है।

source: Taiwan isn't part of China.
hi: ताइवान चीन का हिस्सा नहीं है।

source: Has Tom left?
hi: टॉम चला गया क्या?

source: Is Tom crazy?
hi: टॉम पागल है क्या?

source: Tom didn't show.
hi: टॉम ने दिखाया नहीं।

source: Tom was talking.
hi: टॉम बोल रहा था।

source: Eat with us.
hi: हमारे साथ खाओ।

source: Everybody looked sick.
hi: सभी बीमार लग रहे थे।

source: Fight or die.
hi: लड़ो या मरो।

source: Finish the story.
hi: कहानी खतम करो।

source: I didn't listen.
hi: मैंने नहीं सुनी।

source: I do worry.
hi: चिंता तो में करता ही हूँ।

source: I found somebody.
hi: मुझे कोई मिला।

source: I hate opera.
hi: मुझे ऑपेरा से नफ़रत है।

source: I have evidence.
hi: मेरे पास सबूत है।

source: I have proof.
hi: मेरे पास सबूत है।

source: I like women.
hi: मुझे औरतें पसंद हैं।

source: I made tea.
hi: मैंने चाय बनाई।

source: I need water.
hi: मुझे पानी की ज़रूरत है।

source: What is your planet like?
hi: तुम्हारा ग्रह कैसा है?

source: I was assaulted.
hi: मुझपर हमला किया गया।

source: I was frightened.
hi: मैं डरा हुआ था।

source: I was naked.
hi: मैं नंगा था।

source: I wasn't listening.
hi: मैं सुन नहीं रहा था।

source: I won't go.
hi: मैं नहीं जाऊंगा।

source: I won't sleep.
hi: मैं नहीं सोऊंगा।

source: I'll come along.
hi: मैं साथ आऊँगा।

source: I'm a Christian.
hi: मैं एक ईसाई हूँ।

source: I'm making tea.
hi: मैं चाय बना रहा हूँ।

source: I'm not fighting.
hi: मैं लड़ नहीं रहा।

source: I'm so stupid.
hi: मैं कितना बेवकूफ़ हूँ।

source: I've already called.
hi: मैंने फ़ोन कर लिया है।

source: I've got cookies.
hi: मेरे पास कुकीज़ हैं।

source: Is it blue?
hi: नीला है?

source: Is Monday OK?
hi: सोमवार ठीक है?

source: It looks Egyptian.
hi: मिस्री लगता है।

source: It may hurt.
hi: दर्द हो सकता है।

source: It was difficult.
hi: मुश्किल था।

source: It was easy.
hi: आसान था।

source: It was magic.
hi: जादू थी।

source: It wasn't hard.
hi: मुश्किल नहीं था।

source: It's a promise.
hi: वादा रहा।

source: It's my birthday.
hi: मेरा जन्मदिन है।

source: It's their anniversary.
hi: उनकी सालगिरह है।

source: It's their fault.
hi: गलती उनकी है।

source: It's very old.
hi: बहुत पुराना है।

source: Just stay there.
hi: बस वहीं रहो।

source: Now go home.
hi: अब घर जाओ।

source: Now help me.
hi: अब मेरी मदद करो।

source: One is blue.
hi: एक नीला है।

source: Read it again.
hi: इसे दोबारा पढ़ें।

source: Sing with us.
hi: हमारे साथ गाओ।

source: Somebody's watching you.
hi: कोई तुम्हें देख रहा है।

source: Take us home.
hi: हमें घर ले चलो।

source: His name's Tom.
hi: उसका नाम टॉम है।

source: That was delicious.
hi: वह स्वादिष्ट था।

source: That was magic.
hi: वह जादू थी।

source: That wasn't real.
hi: वह सच नहीं था।

source: That's our train.
hi: वह हमारी ट्रेन है।

source: The soldier ran.
hi: सैनिक भागा।

source: The soldiers laughed.
hi: सैनिक हसे।

source: There is silence.
hi: शांति है।

source: There wasn't time.
hi: वक़्त नहीं था।

source: What a country!
hi: क्या देश है!

source: Where's my cane?
hi: मेरी छड़ी कहाँ है?

source: Where's my daddy?
hi: मेरे पापा कहाँ हैं?

source: Where's my father?
hi: मेरे पापा कहाँ हैं?

source: Where's my mother?
hi: मेरी माँ कहाँ है?

source: Where's my son?
hi: मेरा बेटा कहाँ है?

source: Where's my wife?
hi: मेरी बीवी कहाँ है?

source: Where's your gun?
hi: तेरी बंदूक कहाँ है?

source: Where's your hat?
hi: आपकी टोपी कहाँ है?

source: Which one's yours?
hi: तुम्हारा वाला कौन सा है?

source: In Spain they speak Spanish.
hi: स्पेन में स्पेनिश बोली जाती है।

source: Who told you?
hi: तुम्हें किसने बताया?

source: Who was here?
hi: यहां कौन था?

source: You know her.
hi: तुम उसे जानते हो।

source: You know him.
hi: तुम उसे जानते हो।

source: You may leave.
hi: तुम जा सकते हो।

source: You will die.
hi: तुम मरोगे।

source: You will eat.
hi: तुम खाओगे।

source: You wouldn't understand.
hi: तुम नहीं समझोगे।

source: Tom will dance.
hi: टॉम नाचेगा।

source: He makes fun of everybody.
hi: वह सबका मज़ाक उड़ाता है।

source: There it is!
hi: वह रहा!

source: My family is very proud of me.
hi: मेरे परिवार को मुझ पर बहुत गर्व है।

source: What were you thinking?
hi: तुम सोच क्या रहे थे?

source: Don't talk to Tom.
hi: टॉम से बात मत कीजिए।

source: His name is Tom.
hi: उसका नाम टॉम है।

source: I just saw Tom.
hi: मैंने अभी टॉम को देखा।

source: I'm better than Tom.
hi: मैं टॉम से बेहतर हूँ।

source: It was Tom's fault.
hi: टॉम की गलती थी।

source: Rabbits can swim.
hi: खरगोश तैर सकते हैं।

source: I broke her heart.
hi: मैंने उसका दिल तोड़ा।

source: I broke his heart.
hi: मैंने उसका दिल तोड़ा।

source: I'm a fan of German opera.
hi: मैं जर्मन ऑपेरा का शौकीन हूँ।

source: Gay marriage is legal here.
hi: गे विवाह यहाँ वैध है।

source: Same-sex marriage is legal here.
hi: यहाँ समलैंगिक विवाह वैध है।

source: Greece was the cradle of western civilization.
hi: यूनान पश्चिमी संस्कृति का पालना था।

source: You'll never get my boobs.
hi: तुम्हें मेरे मम्मे कभी नहीं मिलेंगे।

source: It never snows in this country.
hi: इस देश में कभी भी बर्फ नहीं गिरती।

source: There are a lot of mistakes in this translation.
hi: इस अनुवाद में बहुत सारी गलतियाँ हैं।

source: Don't break anything.
hi: कुछ तोड़ना मत।

source: Don't go down there.
hi: वहाँ नीचे मत जाओ।

source: Who's that boy?
hi: वह लड़का कौन है?

source: Don't start doing that.
hi: वह काम शुरु मत करो।

source: I didn't donate blood.
hi: मैंने रक्तदान नहीं किया।

source: I didn't find anything.
hi: मुझे कुछ नहीं मिला।

source: Tom doesn't know that.
hi: टॉम को वह पता नहीं है।

source: Tom won't eat that.
hi: टॉम वह नहीं खाएगा।

source: Tom didn't stop Mary.
hi: टॉम ने मैरी को नहीं रोका।

source: Tom is a poet.
hi: टॉम कवी है।

source: Tom is a politician.
hi: टॉम नेता है।

source: Tom is a soldier.
hi: टॉम सैनिक है।

source: Tom is getting water.
hi: टॉम को पानी मिल रहा है।

source: Tom is here somewhere.
hi: टॉम यहीं कहीं है।

source: Tom is kissing Mary.
hi: टॉम मेरी को किस कर रहा है।

source: Tom is leaving home.
hi: टॉम घर छोड़ के जा रहा है।

source: Tom is my son.
hi: टॉम मेरा लड़का है।

source: Tom is still missing.
hi: टॉम अभी भी लापता है।

source: Tom is still reading.
hi: टॉम अभी भी पढ़ रहा है।

source: Tom is still sleeping.
hi: टॉम अभी भी सो रहा है।

source: Tom is still standing.
hi: टॉम अभी भी खड़ा है।

source: Tom is still there.
hi: टॉम अभी भी वहाँ है।

source: Tom is still working.
hi: टॉम अभी भी काम कर रहा है।

source: Tom is still worried.
hi: टॉम अभी भी चिंतित है।

source: Tom is the best.
hi: टॉम सबसे अच्छा है।

source: Tom is the captain.
hi: टॉम कप्तान है।

source: Tom is the defendant.
hi: टॉम प्रतिवादी है।

source: Tom is the enemy.
hi: टॉम दुशमन है।

source: Tom is the killer.
hi: हत्यारा टॉम है।

source: Tom is the murderer.
hi: खूनी टॉम है।

source: Tom is the strongest.
hi: टॉम सबसे बलवान है।

source: Tom is there alone.
hi: टॉम वहाँ अकेला है।

source: Tom is very sad.
hi: टॉम बहुत उदास है।

source: Tom is waiting outside.
hi: टॉम बाहर इंतज़ार कर रहा है।

source: We don't do anything.
hi: हम कुछ नहीं करते।

source: Where did it go?
hi: कहाँ गया?

source: You're going to die.
hi: तुम मरने वाले हो।

source: Don't bother me with details.
hi: मुझे बारीकियां बता कर तंग मत करो.

source: Answer!
hi: जवाब दो!

source: I'm not like that.
hi: मैं वैसा नहीं हूँ।

source: I'm not gay.
hi: मैं गे नहीं हूँ।

source: Here's what I don't get.
hi: एक बात मेरे समझ नहीं आ रही।

source: I didn't sleep last night.
hi: मैं कल रात सोया नहीं।

source: I don't like this game.
hi: मुझे यह खेल पसंद नहीं है।

source: I don't understand this country.
hi: मुझे यह देश समझ नहीं आता।

source: They released all the prisoners.
hi: उन्होंने सभी कैदीयों को आज़ाद कर दिया है।

source: Tom is a teaching assistant.
hi: टॉम एक शिक्षण सहायक है।

source: That's what I don't understand.
hi: वही तो मुझे समझ नहीं आ रहा।

source: Americans like football in the same way that Japanese like baseball.
hi: अमरिकियों को फ़ुटबॉल पसंद है वैसे ही जैसे जापानीयों को बेसबॉल।

source: I'm going to die.
hi: मैं मरने वाला हूँ।

source: Mary is my girlfriend.
hi: मैरी मेरी गर्लफ़्रेंड है।

source: Mary is my mother.
hi: मैरी मेरी माँ है।

source: Somebody's going to die.
hi: कोई तो मरने वाला है।

source: The old city is surrounded by walls.
hi: पुराना शहर दीवारों से घेरा हुआ है।

source: We don't even know Tom.
hi: हम तो टॉम को जानते तक नहीं।

source: I went home and cried.
hi: मैं घर गया और रोया।

source: I'm Tom.
hi: मैं टौम हूँ।

source: I drink.
hi: मैं पीता हूँ।

source: Dutch is spoken in South Africa and in the Caribbean area.
hi: डच दक्षिण आफ्रिका और कैरीबियन क्षेत्र में बोली जाती है ।

source: Susan Greene... are you Dutch?
hi: सूज़न ग्रीन... क्या आप डच हैं?

source: You didn't recognize me, did you?
hi: तुम ने मुझे पहचाना नहीं, है ना?

source: You knew, didn't you?
hi: तुम्हें पता था, है ना?

source: Have you gone crazy?
hi: पागल हो गये हो क्या?

source: I didn't answer a single question.
hi: मैंने एक भी सवाल का जवाब नहीं दिया।

source: I didn't have any friends in Boston.
hi: मेरे बास्टन में कोई दोस्त नहीं थे।

source: He was lucky.
hi: वह भाग्यवान था।

source: What color is this?
hi: यह कौनसा रंग है?
